### 🌊 Neptune Plan Results

**Terraform Stacks:** `apps/web, apps/web/ci-104-1, apps/web/ci-104-2`

**Neptune completed the plan with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23416463960)

**Command ✅** `terragrunt init -upgrade` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 00:40:34.478 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web] 00:40:34.781 STDOUT tofu: Initializing the backend...
00:40:34.992 STDOUT tofu: 
00:40:34.992 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:40:34.992 STDOUT tofu: use this backend unless the backend configuration changes.
00:40:35.069 STDOUT tofu: Initializing provider plugins...
00:40:35.069 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:40:35.174 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:40:35.297 STDOUT tofu: - Installing hashicorp/local v2.7.0...
00:40:35.533 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:40:35.631 STDOUT tofu: - Installing hashicorp/null v3.2.4...
00:40:35.859 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:40:35.859 STDOUT tofu: Providers are signed by their developers.
00:40:35.859 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
00:40:35.859 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
00:40:35.859 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:40:35.859 STDOUT tofu: selections it made above. Include this file in your version control repository
00:40:35.860 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
00:40:35.860 STDOUT tofu: you run "tofu init" in the future.
00:40:35.860 STDOUT tofu: OpenTofu has been successfully initialized!
00:40:35.860 STDOUT tofu: 
00:40:35.860 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:40:35.860 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:40:35.860 STDOUT tofu: should now work.
00:40:35.860 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:40:35.860 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
00:40:35.860 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-104-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-104-1] 00:40:36.167 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/qWcdvVmsdVjEOwfalmt5LES0oz8/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-104-1] 00:40:36.328 STDOUT tofu: Initializing the backend...
00:40:36.444 STDOUT tofu: 
00:40:36.444 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:40:36.444 STDOUT tofu: use this backend unless the backend configuration changes.
00:40:36.485 STDOUT tofu: Initializing provider plugins...
00:40:36.485 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:40:36.559 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:40:36.693 STDOUT tofu: - Installing hashicorp/local v2.7.0...
00:40:36.930 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:40:37.017 STDOUT tofu: - Installing hashicorp/null v3.2.4...
00:40:37.228 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:40:37.228 STDOUT tofu: Providers are signed by their developers.
00:40:37.228 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
00:40:37.228 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
00:40:37.228 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:40:37.228 STDOUT tofu: selections it made above. Include this file in your version control repository
00:40:37.228 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
00:40:37.228 STDOUT tofu: you run "tofu init" in the future.
00:40:37.228 STDOUT tofu: OpenTofu has been successfully initialized!
00:40:37.229 STDOUT tofu: 
00:40:37.229 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:40:37.229 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:40:37.229 STDOUT tofu: should now work.
00:40:37.229 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:40:37.229 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
00:40:37.229 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-104-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-104-2] 00:40:37.534 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/89Vmx8-ranRqEtS-0Q-9yZ1hqoM/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-104-2] 00:40:37.691 STDOUT tofu: Initializing the backend...
00:40:37.793 STDOUT tofu: 
00:40:37.793 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:40:37.794 STDOUT tofu: use this backend unless the backend configuration changes.
00:40:37.837 STDOUT tofu: Initializing provider plugins...
00:40:37.837 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:40:37.910 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:40:38.054 STDOUT tofu: - Installing hashicorp/null v3.2.4...
00:40:38.271 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:40:38.373 STDOUT tofu: - Installing hashicorp/local v2.7.0...
00:40:38.596 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:40:38.596 STDOUT tofu: Providers are signed by their developers.
00:40:38.596 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
00:40:38.596 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
00:40:38.596 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:40:38.596 STDOUT tofu: selections it made above. Include this file in your version control repository
00:40:38.596 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
00:40:38.596 STDOUT tofu: you run "tofu init" in the future.
00:40:38.596 STDOUT tofu: OpenTofu has been successfully initialized!
00:40:38.596 STDOUT tofu: 
00:40:38.596 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:40:38.597 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:40:38.597 STDOUT tofu: should now work.
00:40:38.597 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:40:38.597 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
00:40:38.597 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web] 00:40:39.562 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
00:40:39.562 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
00:40:39.572 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:40:39.572 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:40:39.573 STDOUT tofu:   + create
00:40:39.573 STDOUT tofu: OpenTofu will perform the following actions:
00:40:39.573 STDOUT tofu:   # local_file.output will be created
00:40:39.573 STDOUT tofu:   + resource "local_file" "output" {
00:40:39.573 STDOUT tofu:       + content              = "apps/web deployed"
00:40:39.573 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:40:39.573 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:40:39.573 STDOUT tofu:       + content_md5          = (known after apply)
00:40:39.573 STDOUT tofu:       + content_sha1         = (known after apply)
00:40:39.573 STDOUT tofu:       + content_sha256       = (known after apply)
00:40:39.573 STDOUT tofu:       + content_sha512       = (known after apply)
00:40:39.573 STDOUT tofu:       + directory_permission = "0777"
00:40:39.573 STDOUT tofu:       + file_permission      = "0777"
00:40:39.573 STDOUT tofu:       + filename             = "./output.txt"
00:40:39.574 STDOUT tofu:       + id                   = (known after apply)
00:40:39.574 STDOUT tofu:     }
00:40:39.574 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
00:40:39.574 STDOUT tofu: 
00:40:39.574 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
00:40:39.574 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
00:40:39.574 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-104-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-104-1] 00:40:40.507 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:40:40.507 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:40:40.507 STDOUT tofu:   + create
00:40:40.507 STDOUT tofu: OpenTofu will perform the following actions:
00:40:40.507 STDOUT tofu:   # local_file.output will be created
00:40:40.507 STDOUT tofu:   + resource "local_file" "output" {
00:40:40.507 STDOUT tofu:       + content              = "apps/web/ci-104-1 deployed"
00:40:40.508 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:40:40.508 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:40:40.508 STDOUT tofu:       + content_md5          = (known after apply)
00:40:40.508 STDOUT tofu:       + content_sha1         = (known after apply)
00:40:40.508 STDOUT tofu:       + content_sha256       = (known after apply)
00:40:40.508 STDOUT tofu:       + content_sha512       = (known after apply)
00:40:40.508 STDOUT tofu:       + directory_permission = "0777"
00:40:40.508 STDOUT tofu:       + file_permission      = "0777"
00:40:40.508 STDOUT tofu:       + filename             = "./output.txt"
00:40:40.508 STDOUT tofu:       + id                   = (known after apply)
00:40:40.508 STDOUT tofu:     }
00:40:40.508 STDOUT tofu:   # null_resource.stack will be created
00:40:40.508 STDOUT tofu:   + resource "null_resource" "stack" {
00:40:40.508 STDOUT tofu:       + id       = (known after apply)
00:40:40.508 STDOUT tofu:       + triggers = {
00:40:40.508 STDOUT tofu:           + "stack" = "apps/web/ci-104-1"
00:40:40.508 STDOUT tofu:         }
00:40:40.508 STDOUT tofu:     }
00:40:40.508 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
00:40:40.508 STDOUT tofu: 
00:40:40.509 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
00:40:40.509 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
00:40:40.509 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-104-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-104-2] 00:40:41.457 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:40:41.458 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:40:41.458 STDOUT tofu:   + create
00:40:41.458 STDOUT tofu: OpenTofu will perform the following actions:
00:40:41.458 STDOUT tofu:   # local_file.output will be created
00:40:41.458 STDOUT tofu:   + resource "local_file" "output" {
00:40:41.458 STDOUT tofu:       + content              = "apps/web/ci-104-2 deployed"
00:40:41.458 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:40:41.458 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:40:41.458 STDOUT tofu:       + content_md5          = (known after apply)
00:40:41.458 STDOUT tofu:       + content_sha1         = (known after apply)
00:40:41.458 STDOUT tofu:       + content_sha256       = (known after apply)
00:40:41.459 STDOUT tofu:       + content_sha512       = (known after apply)
00:40:41.459 STDOUT tofu:       + directory_permission = "0777"
00:40:41.459 STDOUT tofu:       + file_permission      = "0777"
00:40:41.459 STDOUT tofu:       + filename             = "./output.txt"
00:40:41.459 STDOUT tofu:       + id                   = (known after apply)
00:40:41.459 STDOUT tofu:     }
00:40:41.459 STDOUT tofu:   # null_resource.stack will be created
00:40:41.459 STDOUT tofu:   + resource "null_resource" "stack" {
00:40:41.459 STDOUT tofu:       + id       = (known after apply)
00:40:41.459 STDOUT tofu:       + triggers = {
00:40:41.459 STDOUT tofu:           + "stack" = "apps/web/ci-104-2"
00:40:41.459 STDOUT tofu:         }
00:40:41.459 STDOUT tofu:     }
00:40:41.459 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
00:40:41.459 STDOUT tofu: 
00:40:41.459 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
00:40:41.459 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
00:40:41.459 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>


To apply these changes, comment:
```
@neptbot apply
```
